[
  {
    "id": 1,
    "company_id": 1,
    "user_id": 1,
    "summary": "Great Work-Life Balance",
    "ot_satisfy": true,
    "ot_satisfy_reason": "The company's OT policy allows for flexibility, ensuring a healthy work-life balance.",
    "input_experience": "TechSolutions provides a collaborative environment with exciting projects. The supportive team and flexible hours make it an excellent place to work.",
    "input_improvement_suggestion": "Consider more team-building activities to strengthen team bonds.",
    "is_recommended": true
  },
  {
    "id": 2,
    "company_id": 1,
    "user_id": 2,
    "summary": "Positive Experience",
    "ot_satisfy": true,
    "ot_satisfy_reason": "The no OT policy is a huge plus, allowing me to manage my time effectively.",
    "input_experience": "TechSolutions fosters a culture of continuous learning. The leadership is approachable, and the projects are challenging and rewarding.",
    "input_improvement_suggestion": "Expand the training programs for professional development.",
    "is_recommended": true
  },
  {
    "id": 3,
    "company_id": 2,
    "user_id": 1,
    "summary": "Overwhelming Workload",
    "ot_satisfy": false,
    "ot_satisfy_reason": "The workload is overwhelming, and the 'No OT' policy adds pressure.",
    "input_experience": "The workload can be overwhelming, especially during peak periods. The 'No OT' policy adds pressure, making it challenging to meet tight project deadlines.",
    "input_improvement_suggestion": "Reevaluate the 'No OT' policy during peak project periods.",
    "is_recommended": false
  },
  {
    "id": 4,
    "company_id": 2,
    "user_id": 2,
    "summary": "Rewarding Career Growth",
    "ot_satisfy": true,
    "ot_satisfy_reason": "The company values employees' time and promotes a healthy work-life balance.",
    "input_experience": "InnovateTech provides excellent opportunities for career growth. The mentorship programs are valuable, and the company's focus on employee well-being is evident.",
    "input_improvement_suggestion": "Increase transparency in the promotion process.",
    "is_recommended": true
  },
  {
    "id": 5,
    "company_id": 3,
    "user_id": 1,
    "summary": "Disappointed with OT Policy",
    "ot_satisfy": false,
    "ot_satisfy_reason": "The 'No OT' policy is restrictive and hinders project deadlines.",
    "input_experience": "While TechSolutions has a great team and interesting projects, I'm disappointed with the 'No OT' policy. There are times when overtime is necessary to meet project deadlines, and this policy is too restrictive.",
    "input_improvement_suggestion": "Consider a more flexible approach to overtime during peak project periods.",
    "is_recommended": false
  }
]
